# ДЗ:
# 1. Зарегистрироваться на GitHub: https://github.com/
# 2. Создать новый репозиторий (обязательно посмотрите в видео, как это нормально сделать)
# 3. Склонировать репозиторий себе в PyCharm
# 4. Внести изменения в код.
# 5. Запушить изменения.
# 6. Посмотреть, что всё обновилось в репозетории на сайте GitHub.
# 7. Создать новую ветку.
# 8. Внести изменения в ветку и закоммитить -> запушить эти изменения
# 9. Убедиться, что в master ветке в удалённом репозитории изменений нет.
# 10. Создать Pull request на слияние второй ветки и master.
# 11. Смерджить изменения.
# 12. У себя на компьютере переключиться обратно на ветку master
# 13. У себя на компьютере обновить изменения в master ветке: GIT -> update project (merge)