# 1. Создать несколько листов. Сложить их. В новый словарь выбрать только уникальные значения (можете в видосе посмотреть, как это делать)
# 2. Создать несколько словарей. Словари с базовыми типами, словари с листами, словари со словарями.
# 3. Подоставать значения из словарей через .get()
# 4. Положить один словарь в другой. Потом достать значения из вложеного словаря.
# 5. Сделать лист с ключами словаря. Сделать лист со значениями словаря.
# 6. В уже созданном словаре изменить значение элемента (перезаписать другим значением)
# 7. Всё вышеперечисленное повторить несколько раз.


a=2
x=a
a=3
print(x)

c=[1,2,3]
b=c
c[0]=4
print(b)

d='sss'
d='a'