# ДЗ:
# 1. Почитать про обработку ошибок:
# https://habr.com/ru/companies/wunderfund/articles/736526/
# если в этой статье слишком непонятно - тут короче и максимально просто: https://metanit.com/python/tutorial/2.11.php
# 2. Посмотреть список самых популярных исключений (хотя бы 1 раз все прочитать): https://pythonworld.ru/tipy-dannyx-v-python/isklyucheniya-v-python-konstrukciya-try-except-dlya-obrabotki-isklyuchenij.html
# 3. Создать классы: человек, рота, полк. В роте могут содержаться несколько человек, в полку - несколько рот.
# Написать методы:
# - добавления человека в роту, добавления роты в полк.
# - удаления человека из роты или из полка (в этом случае, человек удалиться из роты). Метод на вход должен получать list с несколькими переменными типа Human - как я с автобусом делал.
# - выводить информацию об одном человеке: имя, возраст.
# - выводить информацию об всех людях в роте.
# - выводить информацию об всех людях в полку.
# 4. Для всех методов из п.3 использовать обработку исключений. Можно не обрабатывать отдельные исключения - достаточно общего через просто Except.
# Добиться, чтобы сработало исключение - и обработалось через except.