# ДЗ:
# 1. Почитать про YAML формат: https://ru.wikipedia.org/wiki/YAML
# 2. Почитать про JSON формат: https://habr.com/ru/articles/554274/
# 3. Создать класс, в классе хранить лист словарей (как у меня в коде пример с подключениями - можете придумать что-нибудь своё, например в словарях данные людей будут или ещё что-нибудь)
# 4. Сделать 2 метода для работы с YAML - для сохранения в файл и для чтения из файла. Название фала должно передаваться в метод входным параметром.
# 5. Сделать 2 метода для работы с JSON - для сохранения в файл и для чтения из файла. Название фала должно передаваться в метод входным параметром.
# 6. В другом поле хранить Pandas DataFrame с данными. Написать ещё 2 метода - для сохранения данных в файл .csv и для чтения данных из .csv файла в датафрейм.
# Так же написать для 4, 5, 6 пунктов методы, которые будут просто отображать данные, которые внутри объекта хранятся.
# 7. Попробовать при помощи объекта класса прочитать данные из YAML формата, а сохранить - в JSON.
# 8. Наоборот: прочитать данные из JSON, сохранить в YAML.